viscoelastic/viscoelasticFluidFoam/lidDrivenCavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     &solver;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.882;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.126;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           &maxCo;

maxDeltaT       0.1;

libs ("sinWallVelocity.so");

// ************************************************************************* //
