viscoelastic/viscoelasticFluidFoam/lidDrivenCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        nFaces          1000;
        startFace       1998000;
        closedSolidBodyMotion false;
    }
    fixedWalls
    {
        type            wall;
        nFaces          3000;
        startFace       1999000;
        closedSolidBodyMotion false;
    }
    frontAndBack
    {
        type            empty;
        nFaces          2000000;
        startFace       2002000;
    }
)


// ************************************************************************* //
