viscoelastic/viscoelasticFluidFoam/lidDrivenCavity/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

echo "Running viscoelasticFluidFoam solver"
runParallel $application &nProcs

echo "Done!"
