viscoelastic/viscoelasticFluidFoam/lidDrivenCavity/Allrun.pre
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

echo "Running blockMesh application"
runApplication blockMesh

echo "Running decomposePar application"
runApplication decomposePar

echo "done!"
